const quests = {
    "숙소 선택": {
        title: "📬 퀘스트: 숙소 선택하기",
        tasks: ["🏨 공항에서 30분 이내", "💶 1박 100유로 이하", "🥐 조식 포함"]
    },

    "택시 타기": {
        title: "📬 퀘스트: 택시 타기",
        tasks: ["🗺️ 승강장 위치 파악", "🗣️ 기사에게 목적지 전달", "😀 스몰토크로 점수 얻기"]
    },

    "숙소 입장": {
        title: "📬 퀘스트: 숙소 입장하기",
        tasks: ["✅ 예약 확인하기", "🗣️ 직원에게 설명 듣기", "🚪 방 찾아가기"]
    },

    "식당 추천": {
        title: "📬 퀘스트: 장소 추천 받고 찾아가기",
        tasks: ["✅ 직원에게 갈 만한 식당 추천 받기", "🗺️ 추천 받은 식당에 찾아가기"]
    },

    "식당": {
        title: "📬 퀘스트: 식당에서 주문하고 결제하기",
        tasks: ["✅ 메뉴판 읽고 원하는 메뉴 주문하기", "🗺️ 직원과 대화 후 성공적으로 결제하기"]
    },

    "카페": {
        title: "📬 퀘스트: 카페에서 주문하고 결제하기",
        tasks: ["✅ 메뉴판 읽고 원하는 메뉴 주문하기", "🗺️ 직원과 대화 후 성공적으로 결제하기"]
    },

    "에펠탑": {
        title: "📬 퀘스트: 낯선 사람과 대화하기",
        tasks: ["💬 낯선 사람과 스몰토크", "📷 사진 촬영 부탁하기"]
    },

    "박물관": {
        title: "📬 퀘스트: 박물관에 입장하여 관람하기",
        tasks: ["🎫 박물관 티켓 구매하기", "⚠️ 박물관 규칙 이해하기"]
    },

    "화장실": {
        title: "📬 퀘스트: 화장실 위치를 파악하고 이용하기",
        tasks: ["🗺️ 화장실 찾아가기", "🚻 화장실 이용하기"]
    },

    "리옹메인": {
        title: "📬 퀘스트: 리옹 제대로 즐기기",
        tasks: ["✅ 영화와 미니어처 박물관", "✅ 푸르비에르 대성당", "✅ 떼뜨 도흐 공원"]
    },

    "마르세유메인": {
        title: "📬 퀘스트: 마르세유 제대로 즐기기",
        tasks: ["✅ 유럽 지중해 박물관", "✅ 노트르담 드 라 가르드 대성당", "✅ 마르세유 구 항구"]
    },

    "스트라스부르메인": {
        title: "📬 퀘스트: 스트라스부르 제대로 즐기기",
        tasks: ["✅ 클레베르 광장", "✅ 스트라스부르 노트르담 대성당", "✅ 쁘띠 프랑스"]
    },

    "보르도메인": {
        title: "📬 퀘스트: 보르도 제대로 즐기기",
        tasks: ["✅ 보르도 대성당", "✅ 부르스 광장", "✅ 보르도 와인 체험 박물관"]
    },
};

export default quests;